<template>
  <div class="screen flex screen-5">
    <div class="introduction center">
      <h1>专为开发者打造</h1>
      <p>Koishi 更为开发者提供了众多专业功能，使开发者得以在各种复杂需求中构建规模化的解决方案。</p>
    </div>
    <div class="advantages">
      <div class="advantage">
        <span class="icon"><svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 1024 1024"><path d="M0 512v512h1024V0H0z m825.216-40.789333c26.026667 6.485333 45.824 18.048 64.042667 36.906666 9.429333 10.069333 23.424 28.416 24.533333 32.853334 0.341333 1.28-44.202667 31.146667-71.168 47.914666-0.981333 0.64-4.906667-3.584-9.258667-10.069333-13.226667-19.2-27.008-27.477333-48.128-28.928-31.061333-2.133333-51.029333 14.122667-50.858666 41.258667a37.546667 37.546667 0 0 0 4.352 19.2c6.826667 14.122667 19.541333 22.613333 59.306666 39.808 73.344 31.573333 104.704 52.352 124.202667 81.92 21.76 32.981333 26.666667 85.674667 11.861333 124.842666-16.213333 42.581333-56.533333 71.509333-113.28 81.066667-17.536 3.114667-59.136 2.645333-77.994666-0.768-41.130667-7.338667-80.128-27.648-104.192-54.314667-9.429333-10.368-27.818667-37.546667-26.666667-39.466666a67.413333 67.413333 0 0 1 9.386667-6.016c4.608-2.602667 21.802667-12.544 38.058666-21.973334l29.44-17.066666 6.186667 9.130666c8.618667 13.141333 27.434667 31.189333 38.826667 37.205334 32.682667 17.237333 77.525333 14.805333 99.626666-5.034667a37.674667 37.674667 0 0 0 13.354667-30.72c0-11.861333-1.493333-17.066667-7.68-26.026667-7.936-11.349333-24.192-20.906667-70.357333-40.96-52.821333-22.741333-75.562667-36.864-96.384-59.306666a135.04 135.04 0 0 1-28.117334-51.2c-3.882667-14.464-4.864-50.730667-1.792-65.322667 10.88-51.072 49.408-86.613333 105.002667-97.194667 18.048-3.413333 59.989333-2.133333 77.696 2.261334z m-240.384 42.752l0.341333 41.941333H451.84v378.709333H357.546667v-378.709333H224.341333v-41.130667c0-22.784 0.469333-41.813333 1.109334-42.24 0.512-0.682667 81.621333-1.024 179.925333-0.853333l178.986667 0.512z" fill="currentcolor"></path></svg></span>
        <h2>类型支持</h2>
        <p class="desc">Koishi 完全基于 TypeScript 开发，拥有顶级的类型支持，丰富的代码提示让你在编写代码的时候甚至无需查看文档。</p>
        <p class="learn-more"><router-link to="/">了解更多</router-link></p>
      </div>
      <div class="advantage">
        <span class="icon"><svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 448 512"><path d="M437.2 403.5L320 215V64h8c13.3 0 24-10.7 24-24V24c0-13.3-10.7-24-24-24H120c-13.3 0-24 10.7-24 24v16c0 13.3 10.7 24 24 24h8v151L10.8 403.5C-18.5 450.6 15.3 512 70.9 512h306.2c55.7 0 89.4-61.5 60.1-108.5zM137.9 320l48.2-77.6c3.7-5.2 5.8-11.6 5.8-18.4V64h64v160c0 6.9 2.2 13.2 5.8 18.4l48.2 77.6h-172z" fill="currentcolor"/></svg></span>
        <h2>单元测试</h2>
        <p class="desc">所有核心功能均已经通过单元测试，既确保了可靠性，也为开发者提供了一套测试插件和定位问题的最佳实践。</p>
        <p class="learn-more"><router-link to="/">了解更多</router-link></p>
      </div>
      <div class="advantage">
        <span class="icon"><svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 576 512"><path d="M519.442 288.651c-41.519 0-59.5 31.593-82.058 31.593C377.409 320.244 432 144 432 144s-196.288 80-196.288-3.297c0-35.827 36.288-46.25 36.288-85.985C272 19.216 243.885 0 210.539 0c-34.654 0-66.366 18.891-66.366 56.346 0 41.364 31.711 59.277 31.711 81.75C175.885 207.719 0 166.758 0 166.758v333.237s178.635 41.047 178.635-28.662c0-22.473-40-40.107-40-81.471 0-37.456 29.25-56.346 63.577-56.346 33.673 0 61.788 19.216 61.788 54.717 0 39.735-36.288 50.158-36.288 85.985 0 60.803 129.675 25.73 181.23 25.73 0 0-34.725-120.101 25.827-120.101 35.962 0 46.423 36.152 86.308 36.152C556.712 416 576 387.99 576 354.443c0-34.199-18.962-65.792-56.558-65.792z" fill="currentcolor"/></svg></span>
        <h2>模块热重载</h2>
        <p class="desc">开发 Koishi 插件时，只需轻点保存即可热重载，无需频繁重启机器人，如同前端开发一样丝滑顺畅。</p>
        <p class="learn-more"><router-link to="/">了解更多</router-link></p>
      </div>
    </div>
  </div>
</template>

<script lang="ts" setup>

defineEmits(['scroll-screen'])

</script>

<style lang="scss" scoped>

.advantages {
  max-width: 60rem;
  transition: border-color var(--t-color);
  margin: 6rem 0 2rem;
  gap: 2rem 3rem;
  display: grid;
  grid-template-columns: 1fr 1fr 1fr;

  @media (max-width: 720px) {
    margin: 2rem 0 0;
    grid-template-columns: 1fr;
  }

  .advantage {
    display: grid;

    h2 {
      padding: 0;
      margin: 1rem;
      border-bottom: none;
    }

    .desc {
      margin: 0;
    }

    svg {
      height: 2rem;
    }

    @media (min-width: 720px) {
      text-align: center;
    }

    @media (max-width: 720px) {
      gap: .8rem .2rem;
      align-items: center;
      grid-template-columns: 3rem auto 4rem;

      .icon {
        text-align: center;
        grid-column: 1 / 2;
      }

      svg {
        height: 1.4rem;
      }

      h2 {
        margin: 0;
        text-align: left;
        grid-column: 2 / 3;
      }

      .desc {
        grid-column: 1 / 4;
      }

      .learn-more {
        margin: 0;
        grid-row: 1 / 2;
        grid-column: 3 / 4;
      }
    }
  }
}

</style>
